; domain
(define (domain Mining)
(:requirements :typing :equality)
(:types place event)

(:predicates
(token ?p - place)
(tracePointer ?e - event)
(allowed)
)

(:functions
(total-cost)
)

(:action moveInTheModel#tausplit_3
:precondition (token p_5)
:effect (and (not (allowed)) (not (token p_5)) (token p_10) (token p_8) (increase (total-cost) 0)
)
)

(:action moveSync#checkticket#ev2
:precondition (and (token p_8) (tracePointer ev2))
:effect (and (allowed) (not (token p_8)) (token p_9) (not (tracePointer ev2)) (tracePointer ev3))
)

(:action moveInTheModel#checkticket
:precondition (token p_8)
:effect (and (not (allowed)) (not (token p_8)) (token p_9) (increase (total-cost) 1)
)
)

(:action moveInTheModel#examinecasually
:precondition (token p_10)
:effect (and (not (allowed)) (not (token p_10)) (token p_11) (increase (total-cost) 1)
)
)

(:action moveInTheModel#reinitiaterequest
:precondition (token p_6)
:effect (and (not (allowed)) (not (token p_6)) (token p_5) (increase (total-cost) 1)
)
)

(:action moveSync#rejectrequest#ev5
:precondition (and (token p_4) (tracePointer ev5))
:effect (and (allowed) (not (token p_4)) (token sink) (not (tracePointer ev5)) (tracePointer evEND))
)

(:action moveInTheModel#rejectrequest
:precondition (token p_4)
:effect (and (not (allowed)) (not (token p_4)) (token sink) (increase (total-cost) 1)
)
)

(:action moveInTheModel#paycompensation
:precondition (token p_4)
:effect (and (not (allowed)) (not (token p_4)) (token sink) (increase (total-cost) 1)
)
)

(:action moveSync#registerrequest#ev1
:precondition (and (token source) (tracePointer ev1))
:effect (and (allowed) (not (token source)) (token p_5) (not (tracePointer ev1)) (tracePointer ev2))
)

(:action moveInTheModel#registerrequest
:precondition (token source)
:effect (and (not (allowed)) (not (token source)) (token p_5) (increase (total-cost) 1)
)
)

(:action moveSync#examinethoroughly#ev3
:precondition (and (token p_10) (tracePointer ev3))
:effect (and (allowed) (not (token p_10)) (token p_11) (not (tracePointer ev3)) (tracePointer ev4))
)

(:action moveInTheModel#examinethoroughly
:precondition (token p_10)
:effect (and (not (allowed)) (not (token p_10)) (token p_11) (increase (total-cost) 1)
)
)

(:action moveSync#decide#ev4
:precondition (and (token p_11) (token p_9) (tracePointer ev4))
:effect (and (allowed) (not (token p_11)) (not (token p_9)) (token p_6) (not (tracePointer ev4)) (tracePointer ev5))
)

(:action moveInTheModel#decide
:precondition (and (token p_11) (token p_9))
:effect (and (not (allowed)) (not (token p_11)) (not (token p_9)) (token p_6) (increase (total-cost) 1)
)
)

(:action moveInTheModel#skip_5
:precondition (token p_6)
:effect (and (not (allowed)) (not (token p_6)) (token p_4) (increase (total-cost) 0)
)
)

(:action moveInTheLog#registerrequest#ev1-ev2
:precondition (and (tracePointer ev1) (allowed))
:effect (and (not (tracePointer ev1)) (tracePointer ev2) (increase (total-cost) 1)
))

(:action moveInTheLog#checkticket#ev2-ev3
:precondition (and (tracePointer ev2) (allowed))
:effect (and (not (tracePointer ev2)) (tracePointer ev3) (increase (total-cost) 1)
))

(:action moveInTheLog#examinethoroughly#ev3-ev4
:precondition (and (tracePointer ev3) (allowed))
:effect (and (not (tracePointer ev3)) (tracePointer ev4) (increase (total-cost) 1)
))

(:action moveInTheLog#decide#ev4-ev5
:precondition (and (tracePointer ev4) (allowed))
:effect (and (not (tracePointer ev4)) (tracePointer ev5) (increase (total-cost) 1)
))

(:action moveInTheLog#rejectrequest#ev5-evEND
:precondition (and (tracePointer ev5) (allowed))
:effect (and (not (tracePointer ev5)) (tracePointer evEND) (increase (total-cost) 1)
))

)

; problem
(define (problem Align) (:domain Mining)
(:objects
p_5 - place
sink - place
p_6 - place
p_8 - place
p_9 - place
source - place
p_4 - place
p_10 - place
p_11 - place
ev1 - event
ev2 - event
ev3 - event
ev4 - event
ev5 - event
ev6 - event
ev7 - event
ev8 - event
ev9 - event
evEND - event
)
(:init
(tracePointer ev1)
(allowed)
(token source)
(= (total-cost) 0)
)
(:goal
(and
(not (token p_5))
(token sink)
(not (token p_6))
(not (token p_8))
(not (token p_9))
(not (token source))
(not (token p_4))
(not (token p_10))
(not (token p_11))
(tracePointer evEND)
))
(:metric minimize (total-cost))
)

; plan
1. (movesync#registerrequest#ev1)
   deleted: (token source) (tracepointer ev1)
   added: (token p_5) (tracepointer ev2)
   goals met: 7 of 10
2. (moveinthemodel#tausplit_3)
   deleted: (allowed) (token p_5)
   added: (token p_10) (token p_8)
   goals met: 6 of 10
3. (movesync#checkticket#ev2)
   deleted: (token p_8) (tracepointer ev2)
   added: (allowed) (token p_9) (tracepointer ev3)
   goals met: 6 of 10
4. (movesync#examinethoroughly#ev3)
   deleted: (token p_10) (tracepointer ev3)
   added: (token p_11) (tracepointer ev4)
   goals met: 6 of 10
5. (movesync#decide#ev4)
   deleted: (token p_11) (token p_9) (tracepointer ev4)
   added: (token p_6) (tracepointer ev5)
   goals met: 7 of 10
6. (moveinthemodel#skip_5)
   deleted: (allowed) (token p_6)
   added: (token p_4)
   goals met: 7 of 10
7. (movesync#rejectrequest#ev5)
   deleted: (token p_4) (tracepointer ev5)
   added: (allowed) (token sink) (tracepointer evend)
   goals met: 10 of 10
